In [1]:
import numpy as np
import pandas as pd

In [2]:
np.nan

nan

In [3]:
pd.NA

In [4]:
df = pd.read_csv('movie_scores.csv')

In [5]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

***Keep the data***

In [6]:
df[df["pre_movie_score"].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [7]:
df[df["pre_movie_score"].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [8]:
df[df["pre_movie_score"].notna()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

***Drop the data***

In [9]:
df.dropna(subset=["pre_movie_score"],axis=0)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [10]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

Replace

In [11]:
df["pre_movie_score"]=df["pre_movie_score"].fillna("New")

In [12]:
df

  first_name last_name   age  sex pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m             8.0              10.0
1        NaN       NaN   NaN  NaN             New               NaN
2       Hugh   Jackman  51.0    m             New               NaN
3      Oprah   Winfrey  66.0    f             6.0               8.0
4       Emma     Stone  31.0    f             7.0               9.0

***Interpolation***

In [13]:
airline={"first":100,"Business":np.nan,"econmy_plus":50,"econmy":25}

In [14]:
ser=pd.Series(airline)

In [15]:
ser

first          100.0
Business         NaN
econmy_plus     50.0
econmy          25.0
dtype: float64

In [17]:
ser.interpolate()

first          100.0
Business        75.0
econmy_plus     50.0
econmy          25.0
dtype: float64